АгрегаторМаркетплейсов/src/Documents/ОтчетОПродажахМаркетплейса/ОтчетОПродажахМаркетплейса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПродажахМаркетплейса</name>
  <registerRecords>AccumulationRegister.ПродажиМаркетплейсов</registerRecords>
  <attributes>
    <name>Маркетплейс</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧистаяПрибыль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АгрегаторМаркетплейсов/src/AccumulationRegisters/ПродажиМаркетплейсов/ПродажиМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиМаркетплейсов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧистаяПрибыль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маркетплейс</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АгрегаторМаркетплейсов/src/Documents/ОтчетОПродажахМаркетплейса/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ПродажиМаркетплейсов.Записывать = Истина;

    Для Каждого СтрокаТовары Из Товары Цикл

        Если Не ЗначениеЗаполнено(СтрокаТовары.Товар) Тогда
            Сообщить("Не заполнен товар в строке документа.");
            Отказ = Истина;
            Возврат;
        КонецЕсли;

        Если СтрокаТовары.Количество <= 0 Тогда
            Сообщить("Количество должно быть больше нуля.");
            Отказ = Истина;
            Возврат;
        КонецЕсли;

        СуммаПродажи = СтрокаТовары.Количество * СтрокаТовары.ЦенаПродажи;
        СебестоимостьСтроки = СтрокаТовары.Количество * СтрокаТовары.Товар.Себестоимость;
        ЧистаяПрибыльСтроки = СуммаПродажи - СтрокаТовары.Комиссия - СебестоимостьСтроки;

        Движение = Движения.ПродажиМаркетплейсов.Добавить();

        Движение.Период = Дата;
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;

        Движение.Товар = СтрокаТовары.Товар;
        Движение.Маркетплейс = Маркетплейс;

        Движение.Количество = СтрокаТовары.Количество;
        Движение.СуммаПродажи = СуммаПродажи;
        Движение.СуммаКомиссии = СтрокаТовары.Комиссия;
        Движение.Себестоимость = СебестоимостьСтроки;
        Движение.ЧистаяПрибыль = ЧистаяПрибыльСтроки;

    КонецЦикла;

КонецПроцедуры
